# import numpy as np
# import pandas as pd
import matplotlib.pyplot as plt

file = open("stat.txt", "r")
l = file.read().replace('[', '').replace(']', '').replace(' ', '').split('\n')[:-1]
file.close()

veng_3 = []
veng_4 = []
veng_5 = []

dijkstr = []
levit =[]

veng_opt = []

for e in l:
    # print(e.split(',')[:-2])
    g = e.split(',')[:-2]
    veng_3 += [int(g[0])]
    veng_4 += [int(g[1])]
    veng_5 += [int(g[2])]
    levit += [int(g[3])]
    dijkstr += [int(g[4])]
    veng_opt += [int(g[5])]

# x = range(10, 501, 10)
x = range(1, 71)
# dijkstr = [0, 1, 4, 11, 18, 30, 48, 68, 107, 133, 179, 236, 298, 370, 452, 590, 668, 781, 886, 1042, 950, 1045, 1177, 1336, 1514, 1717, 1925, 2120, 2364, 2622, 2855, 3138, 3439, 3798, 4090, 4444, 4849, 5405, 6047, 6556, 6907, 7368, 7934, 8522, 9030, 9719, 10003, 10601, 11452, 12271, ]
# levit = [0, 1, 2, 4, 9, 13, 19, 29, 48, 69, 75, 99, 127, 163, 207, 270, 312, 371, 443, 506, 526, 531, 597, 683, 788, 901, 1006, 1102, 1254, 1383, 1548, 1659, 1858, 2045, 2221, 2445, 2662, 2846, 3084, 3373, 3641, 3861, 4178, 4518, 4782, 5143, 5504, 5833, 6267, 6629, ]

# veng_5 = [0, 1, 1, 3, 5, 10, 15, 16, 35, 45, 75, 75, 82, 123, 145, 198, 204, 241, 248, 342, 368, 460, 519, 662, 617, 768, 792, 709, 764, 993, 942, 1254, 1179, 1319, 1445, 1642, 1553, 1736, 2098, 2094, 2189, 2009, 2864, 3107, 3008, 3671, 3937, 3699, 4304, 5034, ]
# veng_4 = [0, 0, 0, 1, 1, 2, 3, 4, 12, 14, 16, 12, 35, 48, 50, 55, 75, 88, 98, 122, 119, 152, 187, 141, 201, 203, 222, 237, 254, 200, 413, 292, 311, 481, 670, 572, 633, 631, 546, 573, 792, 677, 683, 849, 742, 645, 799, 1022, 1092, 1149, ]
# veng_3 = [0, 0, 1, 0, 2, 1, 2, 3, 4, 5, 5, 6, 6, 8, 11, 9, 14, 11, 17, 19, 22, 24, 26, 25, 40, 29, 44, 42, 41, 56, 61, 58, 65, 65, 57, 81, 65, 78, 112, 126, 111, 111, 118, 105, 140, 144, 123, 166, 133, 168,]


# plt.figure(figsize=(1, 1))
plt.plot(x, veng_5, label = "венгерский O(n^5)")
plt.plot(x, veng_4, label = "венгерский O(n^4)")
plt.plot(x, veng_3, label = "венгерский O(n^3)")
plt.plot(x, levit, label = "потоки с левитом")
plt.plot(x, dijkstr, label = "потоки с дейкстрой")
plt.plot(x, veng_opt, label = "венгерский O(n^3) мод.")
plt.xlabel("размерность, n")
plt.ylabel("время, мс")
plt.title("сравнение потоковых алгоритмов с венгерскими")
# plt.fill_between(x, y, y1)
plt.legend()

plt.show()